# Module 4 Lab
## Part 1
#### For this part of the lab we’ll work through the mbta.xlsx data. The Massachusetts Bay Transportation Authority (“MBTA”) manages America’s oldest subway, as well as Greater Boston’s commuter rail, ferry, and bus systems. It’s your first day on the job as the T’s data analyst and you’ve been tasked with analyzing average ridership through time. Complete the following data cleaning tasks.

1. Import the data. Note, you'll need to skip the first row and have the first column be used as the index. Check out the read_excel() docs to figure out how to do this. The resulting DataFrame should contain 11 rows and 59 columns and look similar to the below DataFrame

In [34]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_excel(r"C:\Users\Gokul\OneDrive - University of Cincinnati\Desktop\UC_Notes\Statistical Computing\mbta.xlsx")
df.shape

(12, 60)

In [3]:
df = pd.read_excel(r"C:\Users\Gokul\OneDrive - University of Cincinnati\Desktop\UC_Notes\Statistical Computing\mbta.xlsx", skiprows=1, index_col=0)
df.shape

(11, 59)

In [5]:
df.head()

,mode,2007-01,2007-02,2007-03,2007-04,2007-05,2007-06,2007-07,2007-08,2007-09,...,2011-01,2011-02,2011-03,2011-04,2011-05,2011-06,2011-07,2011-08,2011-09,2011-10
1,All Modes by Qtr,NaN,NaN,1187.653,NaN,NaN,1245.959,NaN,NaN,1256.571,...,NaN,NaN,1223.452,NaN,NaN,1302.414,NaN,NaN,1290.549,NaN
2,Boat,4.000,3.600,40.000,4.300,4.900,5.800,6.521,6.572,5.469,...,3.140,3.284,3.674,4.251,4.431,5.474,6.581,6.733,5.003,4.484
3,Bus,335.819,338.675,339.867,352.162,354.367,350.543,357.519,355.479,372.598,...,334.958,346.234,380.399,380.446,385.289,376.317,361.585,353.793,388.271,398.456
4,Commuter Rail,142.200,138.500,137.700,139.500,139.000,143.000,142.391,142.364,143.051,...,128.396,125.463,134.374,134.169,136.140,135.581,132.410,130.616,136.901,128.720
5,Heavy Rail,435.294,448.271,458.583,472.201,474.579,477.032,471.735,461.605,499.566,...,468.418,504.068,516.730,528.631,528.122,529.528,532.888,508.145,550.137,554.932

2. How many missing values are in each column? How many missing values are there in total.

In [6]:
missing_per_column = df.isna().sum()
print("Missing values per column:")
print(missing_per_column)

total_missing = df.isna().sum().sum()
print("\nTotal missing values in the dataset:", total_missing)

Missing values per column:
mode       0
2007-01    1
2007-02    1
2007-03    0
2007-04    1
2007-05    1
2007-06    0
2007-07    1
2007-08    1
2007-09    0
2007-10    1
2007-11    1
2007-12    0
2008-01    1
2008-02    1
2008-03    0
2008-04    1
2008-05    1
2008-06    0
2008-07    1
2008-08    1
2008-09    0
2008-10    1
2008-11    1
2008-12    0
2009-01    1
2009-02    1
2009-03    0
2009-04    1
2009-05    1
2009-06    0
2009-07    1
2009-08    1
2009-09    0
2009-10    1
2009-11    1
2009-12    0
2010-01    1
2010-02    1
2010-03    0
2010-04    1
2010-05    1
2010-06    0
2010-07    1
2010-08    1
2010-09    0
2010-10    1
2010-11    1
2010-12    0
2011-01    1
2011-02    1
2011-03    0
2011-04    1
2011-05    1
2011-06    0
2011-07    1
2011-08    1
2011-09    0
2011-10    1
dtype: int64

Total missing values in the dataset: 39

3. It appears that the data are organized with observations stored as columns rather than as rows. You can fix that. First, though, you can address the missing data. All of the NA values are stored in the first row. This row really belongs in a different data frame; it is a quarterly average of weekday MBTA ridership. Since this data set tracks monthly average ridership, you’ll remove that row. Similarly, the 7th row (Pct Chg / Yr) and the 11th row (TOTAL) are not really observations as much as they are analysis. Go ahead and remove the 7th and 11th rows as well. After removing the first, seventh, and eleventh rows, what are the dimensions of the new DataFrame?

In [8]:
# Remove the 1st, 7th, and 11th rows (positions 0, 6, and 10)
df_clean = df.drop(df.index[[0, 6, 10]])
print("New DataFrame dimensions:", df_clean.shape)

df_clean.head()

New DataFrame dimensions: (8, 59)

,mode,2007-01,2007-02,2007-03,2007-04,2007-05,2007-06,2007-07,2007-08,2007-09,...,2011-01,2011-02,2011-03,2011-04,2011-05,2011-06,2011-07,2011-08,2011-09,2011-10
2,Boat,4.000,3.600,40.000,4.300,4.900,5.800,6.521,6.572,5.469,...,3.140,3.284,3.674,4.251,4.431,5.474,6.581,6.733,5.003,4.484
3,Bus,335.819,338.675,339.867,352.162,354.367,350.543,357.519,355.479,372.598,...,334.958,346.234,380.399,380.446,385.289,376.317,361.585,353.793,388.271,398.456
4,Commuter Rail,142.200,138.500,137.700,139.500,139.000,143.000,142.391,142.364,143.051,...,128.396,125.463,134.374,134.169,136.140,135.581,132.410,130.616,136.901,128.720
5,Heavy Rail,435.294,448.271,458.583,472.201,474.579,477.032,471.735,461.605,499.566,...,468.418,504.068,516.730,528.631,528.122,529.528,532.888,508.145,550.137,554.932
6,Light Rail,227.231,240.262,241.444,255.557,248.262,246.108,243.286,234.907,265.748,...,198.450,219.886,227.935,242.280,225.776,221.865,231.010,220.164,244.949,237.768

4 In this data, variables are stored in rows instead of columns. The different modes of transportation (commuter rail, bus, subway, boat, ...) are variables, providing information about each month’s average ridership. The months themselves are observations (Currently, months are listed as variable names; rather, they should be in their own column). You can tell which is which because as you go through time, the month changes, but the modes of transport offered by the T do not. As is customary, you want to represent variables in columns rather than rows.

Pivot the rows and columns of the mbta data so that all columns are variables of the data. This should result in 3 columns - mode, date, and number of riders in thousands ( thou_riders ).
What are the new dimensions of this data?

In [14]:
if 'mode' in df_clean.columns:
    df_long = df_clean.melt(id_vars='mode', var_name='date', value_name='thou_riders')
else:
    df_long = df_clean.reset_index().rename(columns={'index': 'mode'}).melt(id_vars='mode', var_name='date', value_name='thou_riders')

df_long['thou_riders'] = pd.to_numeric(df_long['thou_riders'], errors='coerce')

try:
    df_long['date'] = pd.to_datetime(df_long['date'], format='%Y-%m')
except Exception:
    df_long['date'] = pd.to_datetime(df_long['date'], errors='coerce')

print("Reshaped dimensions:", df_long.shape)   
df_long.head()

Reshaped dimensions: (464, 3)

            mode       date  thou_riders
0           Boat 2007-01-01        4.000
1            Bus 2007-01-01      335.819
2  Commuter Rail 2007-01-01      142.200
3     Heavy Rail 2007-01-01      435.294
4     Light Rail 2007-01-01      227.231

5. Your data set is already looking much better! Your boss saw what a great job you’re doing and now wants you to do an analysis of the T’s ridership during certain months across all years. Your data set has months in it, so that analysis will be a piece of cake. There’s only one small problem: if you want to look at ridership on the T during every January (for example), the month and year are together in the same column, which makes it a little tricky. You’ll need to separate the month column into distinct month and year columns to make life easier.

        1. Split the month column of mbta at the dash and create a new month column with only the month and a year column with only the year.
        2. View the head of this new mbta data set

In [16]:
df_long['year'] = df_long['date'].dt.year
df_long['month'] = df_long['date'].dt.month

df_long.head()

            mode       date  thou_riders  year  month
0           Boat 2007-01-01        4.000  2007      1
1            Bus 2007-01-01      335.819  2007      1
2  Commuter Rail 2007-01-01      142.200  2007      1
3     Heavy Rail 2007-01-01      435.294  2007      1
4     Light Rail 2007-01-01      227.231  2007      1

In [17]:
df_long['date'] = pd.to_datetime(df_long['date'])

6 Every month, average weekday commuter boat ridership was around 4,000. Then, one month it jumped to 40,000 without warning? Unless the Olympics were happening in Boston that month (they weren’t), this value is certainly an error. You can assume that whoever was entering the data that month accidentally typed 40 instead of 4.

 1. Locate the row and column of the incorrect value.
 2. Replace the incorrect value with 4.

In [18]:
df_long[df_long['thou_riders']==40]

    mode       date  thou_riders  year  month
16  Boat 2007-03-01         40.0  2007      3

In [19]:
df_long['thou_riders'] = df_long['thou_riders'].replace(40, 4.0)
df_long.head()

            mode       date  thou_riders  year  month
0           Boat 2007-01-01        4.000  2007      1
1            Bus 2007-01-01      335.819  2007      1
2  Commuter Rail 2007-01-01      142.200  2007      1
3     Heavy Rail 2007-01-01      435.294  2007      1
4     Light Rail 2007-01-01      227.231  2007      1

In [20]:
df_long[df_long['thou_riders']==4.0]

    mode       date  thou_riders  year  month
0   Boat 2007-01-01          4.0  2007      1
16  Boat 2007-03-01          4.0  2007      3

7 Congrats, your data is now clean and ready for analysis.

 1. Compute the mean ridership per mode.
 2. Compute the mean ridership per mode for the month of January.
 3. Which year had the greatest ridership for the boat mode?
 4. On average, which month experiences the greatest number of passengers on the Heavy Rail mode?

In [21]:
mean_by_mode = (
    df_long.groupby("mode")["thou_riders"]
           .mean()
           .sort_values(ascending=False)
)

print("Mean ridership per mode:\n", mean_by_mode)

Mean ridership per mode:
 mode
Heavy Rail           489.293483
Bus                  358.590448
Light Rail           232.988810
Commuter Rail        137.351534
Trackless Trolley     12.125052
RIDE                   6.603672
Boat                   4.447276
Private Bus            3.352190
Name: thou_riders, dtype: float64

In [22]:
mean_by_mode_jan = (df_long[df_long["month"] == 1].groupby("mode")["thou_riders"].mean().sort_values(ascending=False))
print("\nMean ridership per mode for January:\n", mean_by_mode_jan)

Mean ridership per mode for January:
 mode
Heavy Rail           460.2818
Bus                  342.3718
Light Rail           217.3920
Commuter Rail        137.0198
Trackless Trolley     12.4658
RIDE                   5.9354
Private Bus            3.4746
Boat                   3.3072
Name: thou_riders, dtype: float64

In [23]:
boat_year_totals = (df_long[df_long["mode"].str.contains("boat", case=False)].groupby("year")["thou_riders"].sum().sort_values(ascending=False))

print("\nTotal ridership by year (boat mode):\n", boat_year_totals)
print("\nYear with greatest boat ridership:", boat_year_totals.idxmax())

Total ridership by year (boat mode):
 year
2007    57.055
2010    52.931
2009    50.552
2008    50.349
2011    47.055
Name: thou_riders, dtype: float64

Year with greatest boat ridership: 2007

In [24]:
heavy = df_long[df_long["mode"].str.contains("heavy", case=False)]

mean_heavy_by_month = (heavy.groupby("month")["thou_riders"].mean().sort_values(ascending=False))

print("\nMean Heavy Rail ridership by month:\n", mean_heavy_by_month)
print("\nMonth with greatest Heavy Rail ridership:", mean_heavy_by_month.idxmax())

Mean Heavy Rail ridership by month:
 month
9     517.70580
10    516.42520
4     501.91240
6     497.65420
7     495.26940
5     494.73740
11    489.65700
3     483.99600
2     481.39340
8     477.42940
1     460.28180
12    446.59225
Name: thou_riders, dtype: float64

Month with greatest Heavy Rail ridership: 9

# Part 2
### For this module we will be using the completejourney_py data sets that you saw in the lesson 4b reading:

1 Using the transactions and demographics data, how many of the 1,469,307 transactions do we have demographic information for?

In [25]:
import pandas as pd
from completejourney_py import get_data

In [26]:
cj = get_data()
print("Available cj_data tables:", list(cj.keys()))

Available cj_data tables: ['campaign_descriptions', 'coupons', 'promotions', 'campaigns', 'demographics', 'transactions', 'coupon_redemptions', 'products']

In [27]:
transactions = cj['transactions']
demographics = cj['demographics']
products = cj['products']

In [28]:
merged_demo = transactions.merge(demographics, how='outer', indicator=True)

In [29]:
common_col = 'household_id'  # typical name; change if different
num_with_demo = transactions.merge(demographics, how='inner', on=common_col).shape[0]
print("Transactions with demographic info:", num_with_demo, "out of", transactions.shape[0])

Transactions with demographic info: 828850 out of 1469307

2 Using the transactions and demographics data, compute the total sales_value by age category to identify which age group generates the most sales.

In [30]:
merge_td = transactions.merge(demographics, how='left', on=common_col)

age_cols = [c for c in demographics.columns if 'age' in c.lower()]
print("Possible age columns in demographics:", age_cols)

age_col = 'age' if 'age' in demographics.columns else (age_cols[0] if age_cols else None)
if age_col is None:
    raise RuntimeError("No age column found in demographics. Inspect demographics.columns.")
sales_by_age = merge_td.groupby(age_col, as_index=False)['sales_value'].sum().sort_values('sales_value', ascending=False)
print("Total sales by age group:\n", sales_by_age.head())

Possible age columns in demographics: ['age']
Total sales by age group:
      age  sales_value
3  45-54    971822.19
2  35-44    724357.40
1  25-34    453372.46
5    65+    176600.84
4  55-64    173153.70

3 Identify all different products that contain “pizza” in their product_type description. Which of these products produces the greatest amount of total sales (compute total sales by product ID and product type)?

In [31]:
pizza_mask = products['product_type'].str.contains('pizza', case=False, na=False)
pizza_products = products[pizza_mask].copy()
print("Number of product types containing 'pizza':", pizza_products.shape[0])

pizza_sales = (
    transactions
    .merge(pizza_products[['product_id', 'product_type']], how='inner', on='product_id')
    .groupby(['product_id', 'product_type'], as_index=False)
    .agg(total_sales=('sales_value', 'sum'))
    .sort_values('total_sales', ascending=False)
)
print("Top pizza products by total sales:\n", pizza_sales.head())

Number of product types containing 'pizza': 532
Top pizza products by total sales:
      product_id       product_type  total_sales
97       944139  PIZZA/TRADITIONAL      1344.50
70       906838      PIZZA/PREMIUM      1263.78
357    12648296  PIZZA/TRADITIONAL      1230.36
113      969568  PIZZA/TRADITIONAL      1125.18
85       925626      PIZZA/ECONOMY      1017.60

4 Identify all products that are categorized ( product_category ) as “pizza” but are considered a “snack” or “appetizer” (via product_type ). Which of these products ( product_id ) have the most number of sales (measured by quantity )?

In [32]:
pizza_cat = products['product_category'].str.contains('pizza', case=False, na=False)
snack_app = products['product_type'].str.contains('snack|appetizer', case=False, na=False)
pizza_snack = products[pizza_cat & snack_app].copy()
print("Products categorized as pizza but product_type snack/appetizer:", pizza_snack.shape[0])

pizza_snack_sales = (
    transactions
    .merge(pizza_snack[['product_id', 'product_type']], how='inner', on='product_id')
    .groupby(['product_id', 'product_type'], as_index=False)
    .agg(total_quantity=('quantity', 'sum'))
    .sort_values('total_quantity', ascending=False)
)
print("Top pizza-as-snack/appetizer products by quantity sold:\n", pizza_snack_sales.head())

Products categorized as pizza but product_type snack/appetizer: 225
Top pizza-as-snack/appetizer products by quantity sold:
     product_id       product_type  total_quantity
18      845193  SNACKS/APPETIZERS             847
34      890695  SNACKS/APPETIZERS             718
37      907631  SNACKS/APPETIZERS             632
22      856252  SNACKS/APPETIZERS             479
79     1103105  SNACKS/APPETIZERS             276

5 Identify all products that contain “peanut butter” in their product_type. How many unique products does this result in? For these products, compute the total sales_value by month based on the transaction_timestamp . Which month produces the most sales value for these products?

In [33]:
pb_mask = products['product_type'].str.contains('peanut butter', case=False, na=False)
pb_products = products[pb_mask].copy()
num_unique_pb = pb_products['product_id'].nunique()
print("Unique 'peanut butter' products:", num_unique_pb)

tx_pb = transactions.merge(pb_products[['product_id','product_type']], how='inner', on='product_id')

tx_pb['transaction_timestamp'] = pd.to_datetime(tx_pb['transaction_timestamp'])
tx_pb['month'] = tx_pb['transaction_timestamp'].dt.strftime('%Y-%m')  # year-month
sales_by_month_pb = tx_pb.groupby('month', as_index=False)['sales_value'].sum().sort_values('sales_value', ascending=False)
print("Peanut butter sales by month (top months):\n", sales_by_month_pb)

Unique 'peanut butter' products: 144
Peanut butter sales by month (top months):
       month  sales_value
11  2017-12      1019.08
8   2017-09       905.36
7   2017-08       895.10
10  2017-11       882.32
9   2017-10       878.89
5   2017-06       865.15
6   2017-07       863.38
0   2017-01       863.36
4   2017-05       850.37
3   2017-04       790.18
1   2017-02       755.76
2   2017-03       733.60